# 11. 조건에 맞는 회원수 구하기

In [2]:
import pandas as pd

df11 = pd.read_csv('../datasets/USER_INFO.csv')
# joined 데이터 datetime으로
df11['joined'] = pd.to_datetime(df11['joined'], format='mixed')  ## 데어타기 일관된 형식이 아니라면 'mixed' 파라미터를 넣으면 조정을 해줌
print(len(df11.loc[(df11['joined'].dt.year == 2021) & (df11['age'] >= 20) & (df11['age'] <=20)]), '명')

9 명

# 12. 가장 비싼 상품 구하기

In [4]:
df12 = pd.read_csv('../datasets/PRODUCT.csv')
max(df12['price'])

85000

# 13. 12세 이하인 여자 환자 목록 출력하기

In [6]:
df13 = pd.read_csv('../datasets/PATIENT.csv', encoding='cp949', header=1)
df13 = df13.drop(columns=['GEND_CD'], axis=1)
df13['TLNO'] = df13['TLNO'].fillna('None')
df13.loc[df13['AGE'] <=12].sort_values(by=['AGE','PT_NAME'], ascending=[False,True])

         PT_NO PT_NAME  AGE          TLNO
8   PT22000009      한나   12  1032323117.0
17  PT22000018      안나   11          None
18  PT22000019      바라   10  1079068799.0
21  PT22000022     스티치    9          None
5   PT22000006      뽀뽀    8          None
3   PT22000004      크롱    7          None
4   PT22000005      포비    7          None
11  PT22000012     뿡뿡이    5          None

# 14. 인기있는 아이스크림

In [8]:
df14 = pd.read_csv('../datasets/FIRST_HALF.csv')
df14.sort_values(by=['TOTAL_ORDER', 'SHIPMENT_ID'], ascending=[False, True])

   SHIPMENT_ID           FLAVOR  TOTAL_ORDER
1          101        chocolate         3200
6          105  white_chocolate         3100
4          109       strawberry         3100
5          102          vanilla         2800
0          104          caramel         2600
3          106            peach         2450
2          103   mint_chocolate         1700

# 15. 흉부외과 또는 일반외과 의사 목록 출력하기

In [10]:
df15 = pd.read_csv('../datasets/DOCTOR.csv', encoding='cp949')

# 고용일자 날짜형으로
df15['HIRE_YMD'] = pd.to_datetime(df15['HIRE_YMD'], format='mixed')
df15 = df15.loc[df15['MCDP_CD'].isin(['CS','GS'])][['DR_NAME','DR_ID','MCDP_CD','HIRE_YMD']]
df15.sort_values(by=['HIRE_YMD','DR_NAME'], ascending=[False,True])

   DR_NAME       DR_ID MCDP_CD   HIRE_YMD
1       니모  DR20200012      CS 2020-03-01
9       윈더  DR20190029      CS 2019-03-01
7      뽀로로  DR20170123      GS 2017-03-01
5        벨  DR20100039      GS 2010-07-01
10     자스민  DR20100032      GS 2010-03-01
14      패티  DR20090001      CS 2009-07-01
3       루피  DR20090029      CS 2009-03-01